#! /usr/local/bin/rexx

/******************************************************************************/
/* TRANSLATE CHARS:                                                           */
/*                                                                            */
/*      Reads characters one by one, shows what they are in hex format.       */
/******************************************************************************/

parse arg filein fileout
out_string = ''
count_cr = 0

do j=1 while chars(filein) > 0
  out_char = '' c2x(charin(filein))

  select
    when out_char = "0A" then do
      call charout, " Carridge Return"
    end /* Do */
    otherwise
      call charout, out_char
  end /* Select */

  call charout fileout, out_char
end
